ns-emacs.org
#+title: GNU Emacs Config
#+author: nshan651

* Early Initialization
This is the first file that Emacs reads when starting up. It should contain code that does not depend on any package or the proportions of the Emacs frame. In general, this early initialization file is meant to set up a few basic things before Emacs produces the initial frame by delegating to the =init.el=.

** Basic frame settings
These are general frame settngs. Notice the frame-resize-pixelwise and frame-inhibit-implied-resize: by default Emacs will resize the frame if you adjust the font size, which I never want.

#+begin_src emacs-lisp :tangle "early-init.el"
  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '("%b")
        ring-bell-function 'ignore
        use-dialog-box t ; only for mouse events, which I seldom use
        use-file-dialog nil
        use-short-answers t
        inhibit-splash-screen t
        inhibit-startup-screen t
        inhibit-startup-message t
        initial-scratch-message nil
        inhibit-x-resources t
        inhibit-startup-echo-area-message user-login-name ; read the docstring
        inhibit-startup-buffer-menu t)

  (set-fringe-mode 10) ; Give some breathing room

  (menu-bar-mode -1) ; Disable the menu bar

  ;; Disable graphical elements
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)

  ;; Default for fill column should be 80 (not 70 like emacs would have it!!!)
  (setq-default fill-column 80)
#+end_src

** Improve scrolling
#+begin_src emacs-lisp :tangle "early-init.el"
  ;; Improve mouse scrolling
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
  (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
  (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse

  ;; Start scrolling when cursor is with 25% of the top or bottom of the screen.
  (setq scroll-margin (floor (* 0.25 (window-height))))

  ;; Vim-like key scrolling
  (setq scroll-step 1
        scroll-conservatively 10000
        next-screen-context-lines 5
        ;; move by logical lines rather than visual lines (better for macros)
        line-move-visual nil)
#+end_src

** Line Numbering
#+begin_src emacs-lisp :tangle "early-init.el"
  (column-number-mode)
  (global-display-line-numbers-mode t)
  ;; Relative line numbers
  (menu-bar--display-line-numbers-mode-relative)

  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  ;; Revert Dired and other buffers
  (setq global-auto-revert-non-file-buffers t)

  ;; Revert buffers when the underlying file has changed
  (global-auto-revert-mode 1)
#+end_src

** Garbage collection
Here we maximize the GC threshold to make Emacs boot a bit faster.

#+begin_src emacs-lisp :tangle "early-init.el"
;; Temporarily increase the garbage collection threshold.  These
;; changes help shave off about half a second of startup time.  The
;; `most-positive-fixnum' is DANGEROUS AS A PERMANENT VALUE.  See the
;; `emacs-startup-hook' a few lines below for what I actually use.
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.5)

;; Same idea as above for the `file-name-handler-alist' and the
;; `vc-handled-backends' with regard to startup speed optimisation.
;; Here I am storing the default value with the intent of restoring it
;; via the `emacs-startup-hook'.
(defvar ns-emacs--file-name-handler-alist file-name-handler-alist)
(defvar ns-emacs--vc-handled-backends vc-handled-backends)

(setq file-name-handler-alist nil
      vc-handled-backends nil)

(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 1024 1024 20)
                  gc-cons-percentage 0.2
                  file-name-handler-alist ns-emacs--file-name-handler-alist
                  vc-handled-backends ns-emacs--vc-handled-backends)))
#+end_src

** Declare all themes as safe
#+begin_src emacs-lisp :tangle "early-init.el"
  (setq custom-safe-themes t)
#+end_src

** Initialize the package cache
I use the standard package.el.
#+begin_src emacs-lisp :tangle "early-init.el"
  ;; Initialise installed packages at this early stage, by using the available cache.
  (setq package-enable-at-startup t)
#+end_src

* Init Configuration
** Disable backups and lockfiles
#+begin_src emacs-lisp :tangle "init.el"
(setq make-backup-files nil)
(setq backup-inhibited nil) ; Not sure if needed, given `make-backup-files'
(setq create-lockfiles nil)
#+end_src

** Make native compilation silent
#+begin_src emacs-lisp :tangle "init.el"
;; Make native compilation silent and prune its cache.
(when (native-comp-available-p)
  (setq native-comp-async-report-warnings-errors 'silent) ; Emacs 28 with native compilation
  (setq native-compile-prune-cache t)) ; Emacs 29
#+end_src

** Send custom-file to the shadow realm
By default, Emacs writes persistent customisations to the end of the user’s init file. These are encapsulated in a “custom” block. Emacs writes those whenever the user does something with M-x customize or related.

I personally prefer writing the actual Elisp over using the interface of M-x customize. I also want my init file to only ever contain what I wrote and to never, ever evaluate code I have not called myself.

#+begin_src emacs-lisp :tangle "init.el"
;; Disable the damn thing by making it disposable.
(setq custom-file (make-temp-file "emacs-custom-"))
#+end_src

** Enable and disable certain commands
Some Emacs commands are disabled by default. This means that Emacs will produce a warning when we try to invoke them and will ask us for confirmation. Here I define which commands I want to have enabled and then put some on the disabled list.

#+begin_src emacs-lisp :tangle "init.el"
;; Enable these.
(mapc
 (lambda (command)
   (put command 'disabled nil))
 '(list-timers narrow-to-region narrow-to-page upcase-region downcase-region))

;; And disable these.
(mapc
 (lambda (command)
   (put command 'disabled t))
 '(project-eshell overwrite-mode iconify-frame diary))
#+end_src

** Pre-load package configs in =lisp= directory
#+begin_src emacs-lisp :tangle "init.el"
  (defun ns/load-lisp-config (file-list)
    "Loads all config files in lisp directory."
    (dolist (file file-list)
      (let ((full-path (locate-user-emacs-file (concat "lisp/" file))))
        (when (file-readable-p full-path)
          (load full-path)))))

  ;; Load paths in a specific order.
  (let ((ns/file-list
         '("evil-config.el"
           "theme-config.el"
           "development-config.el"
           "ui-config.el"
           "org-config.el"
           "org-roam-config.el"
           "programming-languages-config.el"
           "terminal-config.el"
           "applications-config.el"
           "window-config.el"
           "dired-config.el")))

    (ns/load-lisp-config ns/file-list))

  ;; Load gptel system prompts.
  ;; (load (locate-user-emacs-file "etc/prompts.el"))

  ;; Also load `feed.el'.
  (load (locate-user-emacs-file "etc/feed.el"))
#+end_src

** Package setup
Setup package archives for =package.el=.

#+begin_src emacs-lisp :tangle "init.el"
  ;; Packages
  (require 'package)

  (setq package-vc-register-as-project nil) ; Emacs 30

  (add-hook 'package-menu-mode-hook #'hl-line-mode)

  (setq package-archives
        '(("elpa" . "https://elpa.gnu.org/packages/")
          ("melpa" . "https://melpa.org/packages/")))

  ;; Highest number gets priority (what is not mentioned has priority 0)
  (setq package-archive-priorities
        '(("elpa" . 2)
          ("melpa" . 1)))
#+end_src

** Load Some Basic Packages
These are just some nice packages to have around.

*** Async
Provides asynchronous bytecode compilation and various other actions.

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (use-package async
    :defer t
    :init
    (dired-async-mode 1))
#+end_src

*** Savehist
Persist history over Emacs restarts. Vertico sorts by history position.
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (use-package savehist
    :init
    (setq history-length 25)
    (savehist-mode t))
#+end_src
*** Repeat
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (use-package repeat
    :defer 10
    :init
    (repeat-mode +1))
#+end_src

*** Clean Whitespaces
Automatically trim extraneous whitespaces.

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(use-package ws-butler
  :config
  (ws-butler-global-mode 1))
#+end_src

** Clipboard
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (setq select-enable-clipboard t)
  (setq x-select-enable-clipboard t)
#+end_src

** Auth Source
Auth source is a built in way to manage secrets in Emacs. For now I'm just using this along with =password-sore= to manage API keys.
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (use-package auth-source-pass
    :custom
    (auth-source-pass-filename
     (expand-file-name
      "password-store/apikeys"
      (or (getenv "XDG_DATA_HOME")
          (expand-file-name "~/.local/share"))))
    :init
    (auth-source-pass-enable))
#+end_src
* Keybindings
All my keybindings are controlled by evil mode.

** Evil Keybindings
Welcome to the dark side!  Load my custom keybindings.

#+begin_src emacs-lisp :tangle "lisp/evil-config.el" :mkdirp yes
  (use-package evil
    :custom
    (evil-want-integration t)
    (evil-want-keybinding nil)
    (evil-want-C-u-scroll t)
    (evil-want-C-i-jump nil)
    (evil-respect-visual-line-mode t)
    :config
    (evil-mode 1)
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))
#+end_src

