ns-emacs.org
** Evil Collection
Evil collection adds some additional compatibility to modes that otherwise don't play well with evil-mode.
#+begin_src emacs-lisp :tangle "lisp/evil-config.el" :mkdirp yes
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+end_src

** General
General is the best method that I've found for organizing keybindings.

#+begin_src emacs-lisp :tangle "lisp/evil-config.el" :mkdirp yes
  (use-package general
    :after evil
    :config
    ;; General-purpose leader prefix.
    (general-create-definer ns/leader-spc
      :states '(normal visual)
      :keymaps 'override
      :prefix "SPC")
    ;; Cosmetics.
    (general-create-definer ns/leader-t
      :states 'normal
      :keymaps 'override
      :prefix "t")
    ;; Read-only docs.
    (general-create-definer ns/leader-r
      :states 'motion
      :prefix "r")
    ;; Magit operations.
    (general-create-definer ns/leader-m
      :states 'normal
      :prefix "m")
    ;; Window management.
    (general-create-definer ns/leader-ca
      :states 'normal
      :keymaps 'override
      :prefix "C-a")
    ;; Executive.
    (general-create-definer ns/leader-comma
      :states 'normal
      :prefix ","))
    ;; Misc.
    (general-create-definer ns/leader-ct
      :keymaps '(insert normal)
      :keymaps 'override
      :prefix "C-t")
#+end_src

** Basic Keybindings
These are basic keybindings that aren't tied to any particular package (except evil). I chose to group most of my keybindings by package. Personally, I find this approach makes it easier to find what I need.

#+begin_src emacs-lisp :tangle "lisp/evil-config.el" :mkdirp yes
  ;; Bind C-x C-b to ibuffer.
  (keymap-global-set "C-x C-b" 'ibuffer)
  ;; Make ESC quit prompts.
  (keymap-global-set "<escape>" 'keyboard-escape-quit)
  ;; Sensible copy-paste behavior.
  (keymap-global-set "C-S-c" 'copy-region-as-kill)
  (keymap-global-set "C-S-v" 'yank)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (general-def 'motion
    "j" 'evil-next-visual-line
    "k" 'evil-previous-visual-line)

  (ns/leader-spc
    "f"  'find-file
    "k"  'kill-buffer
    "eb" 'eval-buffer)

  ;; Compiling and recompiling.
  (general-def 'normal
    :prefix "g"
    "c" 'compile
    "r" 'recompile)

  ;; Manage windows
  (ns/leader-ca 'override
    "<backspace>" 'delete-window
    "\\"          'split-window-right
    "-"           'split-window-below
    ;; Windmove keys for additional window navigation
    "h"          'windmove-left
    "l"           'windmove-right
    "k"          'windmove-up
    "j"           'windmove-down)

  ;; Window resizing
  ;; "C-h"        (lambda () (interactive) (shrink-window-horizontally 21))
  ;; "C-l"         (lambda () (interactive) (enlarge-window-horizontally 21))
  ;; "C-j"         (lambda () (interactive) (enlarge-window 11))
  ;; "C-k"        (lambda () (interactive) (shrink-window 11))

  ;; https://www.emacswiki.org/emacs/WindowResize
  (defun ns/define-x-pos ()
    "Find the window's position on the x-axis."
    (let* ((win-edges (window-edges))
           (x-min (nth 0 win-edges))
           (x-max (nth 2 win-edges))
           (max-width (+ 2 (frame-width))))
      (cond
       ((equal max-width x-max)
        "right")
       ((and (> x-min 0) (< x-max max-width))
        "mid")
       (t "left"))))

  (defun ns/win-resize-left ()
    (interactive)
    (let ((x-pos (ns/define-x-pos)))
      (cond
       ((equal "right" x-pos)
        (enlarge-window-horizontally +15))
       (t (enlarge-window-horizontally -15))
       ))
    )

  (defun ns/win-resize-right ()
    (interactive)
    (let ((x-pos (ns/define-x-pos)))
      (cond
       ((equal "right" x-pos)
        (enlarge-window-horizontally -15))
       (t (enlarge-window-horizontally +15))
       ))
    )

  (ns/leader-ca 'override
    "C-h"       (lambda () (interactive)
                  (ns/win-resize-left))
    "C-l"        (lambda () (interactive)
                   (ns/win-resize-right))
    "C-j"         (lambda () (interactive) (enlarge-window 11))
    "C-k"        (lambda () (interactive) (shrink-window 11)))

#+end_src
*** Commenting
Emacs' built in commenting functionality =comment-dwim= (usually bound to =M-;=) doesn't always comment things in the way you might expect so we use [[https://github.com/redguardtoo/evil-nerd-commenter][evil-nerd-commenter]] to provide a more familiar behavior.  I've bound it to =M-/= since other editors sometimes use this binding but you could also replace Emacs' =M-;= binding with this command.

#+begin_src emacs-lisp :tangle "lisp/evil-config.el" :mkdirp yes
  (use-package evil-nerd-commenter
    :general ("M-/" 'evilnc-comment-or-uncomment-lines))
#+end_src
** Mouse Settings

* Theme Configuration
** Color Theme
#+begin_src emacs-lisp :tangle "lisp/theme-config.el" :mkdirp yes
  ;; Pull in some nice themes.
  (use-package modus-themes) ; Included since Emacs 27+.
  (use-package ef-themes)
  (use-package doom-themes)
#+end_src

** Custom theme
My custom color theme is a minor modification of =modus-vivendi=.
#+begin_src emacs-lisp :tangle "lisp/theme-config.el" :mkdirp yes
  (load-theme 'modus-vivendi)
  (set-face-attribute 'default nil :background "#1f1f1f")

  ;; Enhance org-mode elements.
  (with-eval-after-load 'org
    (set-face-attribute 'org-block nil :background "#2b2b2b")
    (set-face-attribute 'org-verbatim nil :foreground "#fffaaa" :weight 'bold)
    (set-face-attribute 'org-code nil :foreground "#ff599c"))

  ;; Make gptel-rewrite more readable.
  (with-eval-after-load 'gptel-rewrite
    (set-face-attribute 'gptel-rewrite-highlight-face nil
                        :inherit 'default
                        :background "#413847"
                        :extend t))
#+end_src

** Transparency
#+begin_src emacs-lisp :tangle "lisp/theme-config.el" :mkdirp yes
  (defun ns/toggle-transparency ()
    "Toggle transparency of Emacs frame."
    (interactive)
    (if (equal (car (frame-parameter (selected-frame) 'alpha)) 100)
        (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
      (set-frame-parameter (selected-frame) 'alpha '(100 . 100))))

  ;; Binding to toggle between default and alt theme, inspired by 'modus-themes-toggle`
  (define-key global-map (kbd "<f4>") (lambda () (interactive)
                                        (ns/toggle-transparency)))
#+end_src

** Font Configuration
Set font details here.

#+begin_src emacs-lisp :tangle "lisp/theme-config.el" :mkdirp yes
  ;; Set base font sizes
  (defvar efs/default-font-size 110)
  (defvar efs/default-variable-font-size 110)

  (set-face-attribute 'default nil :font "Fira Code Retina" :height efs/default-font-size)

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :font "Fira Code Retina" :height efs/default-font-size)

  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :font "Cantarell" :height
                      efs/default-variable-font-size :weight 'regular)

  ;; Nerd icon fonts
  (use-package nerd-icons
    :custom
    ;; "Symbols Nerd Font Mono" is the recommended default.
    (nerd-icons-font-family "Symbols Nerd Font Mono"))
#+end_src
** Modeline
#+begin_src emacs-lisp :tangle "lisp/theme-config.el" :mkdirp yes
  (use-package doom-modeline
    :init (doom-modeline-mode 1))

  ;; Add some additional UI elements
  (display-time-mode 1)
#+end_src

** Tab Widths
#+begin_src emacs-lisp :tangle "lisp/theme-config.el" :mkdirp yes
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 4)
  (setq-default c-basic-offset 4)
#+end_src

* UI Enhancements
Some UI enhancements that supercharge Emacs.

** Consult
#+begin_src emacs-lisp :tangle "lisp/ui-config.el" :mkdirp yes
  (use-package consult
    ;; Enable automatic preview at point in the *Completions* buffer. This is
    ;; relevant when you use the default completion UI.
    :hook (completion-list-mode . consult-preview-at-point-mode)

    ;; The :init configuration is always executed (Not lazy)
    :init

    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    (setq register-preview-delay 0.5
          register-preview-function #'consult-register-format)

    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    (advice-add #'register-preview :override #'consult-register-window)

    ;; Use Consult to select xref locations with preview
    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)

    ;; Configure other variables and modes in the :config section,
    ;; after lazily loading the package.
    :config

    (consult-customize
     consult-theme :preview-key '(:debounce 0.2 any)
     consult-ripgrep consult-git-grep consult-grep
     consult-bookmark consult-recent-file consult-xref
     consult--source-bookmark consult--source-file-register
     consult--source-recent-file consult--source-project-recent-file
     ;; :preview-key "M-."
     :preview-key '(:debounce 0.4 any))

    ;; Optionally configure the narrowing key.
    (setq consult-narrow-key "<"))
#+end_src

*** Consult Keybindings
#+begin_src emacs-lisp :tangle "lisp/ui-config.el" :mkdirp yes
  ;; Choose a theme.
  (ns/leader-t "t" '(consult-theme :wk "Choose a theme"))

  ;; Registers.
  (general-def 'override
    ("M-#" . consult-register-load)
    ("M-'" . consult-register-store)
    ("C-M-#" . consult-register)
    ("M-y" . consult-yank-pop))

  ;; Searching `search-mode-map'.
  (general-def 'override
    :keymaps 'isearch-mode-map
    "C-s" 'consult-line
    "M-e"  'consult-isearch-history
    "M-s e" 'consult-isearch-history)

  ;; Minibuffer history.
  (general-def 'override
    :keymaps 'minibuffer-local-map
    "M-s" 'consult-history)

  ;; Buffer management
  (ns/leader-spc
    ;; repeat-complex-command
    "M-:" 'consult-complex-command
    "b"   '(:ignore t :wk "consult buffer selection")
    ;; switch-to-buffer
    "bb"  '(consult-buffer :wk "consult buffer")
    ;; switch-to-buffer-other-window
    "b/"  '(consult-buffer-other-window :wk "open buffer in another window")
    ;; switch-to-buffer-other-frame
    "b\\" '(consult-buffer-other-frame :wk "open buffer in another frame")
    ;; bookmark-jump
    "br"  '(consult-bookmark :wk "bookmark jump")
    ;; project-switch-to-buffer
    "bp"  '(consult-project-buffer :wk "switch between project buffers"))

  ;; C-c bindings in `mode-specific-map'
  (general-def 'normal
    :keymaps 'mode-specific-map
    :prefix "C-c"
    "M-x" 'consult-mode-command
    "h"   'consult-history
    "k"   'consult-kmacro
    "m"   'consult-man
    "i"   'consult-info)

  ;; M-g bindings in `goto-map'
  (general-def 'normal
    :keymaps 'goto-map
    :prefix "M-g"
    "f"   'consult-flymake
    "g"   'consult-goto-line       ;; orig. goto-line
    "M-g" 'consult-goto-line       ;; orig. goto-line
    "o"   'consult-outline         ;; Alternative: consult-org-heading
    "m"   'consult-mark
    "k"   'consult-global-mark
    "i"   'consult-imenu
    "I"   'consult-imenu-multi)

  ;; M-s bindings in `search-map'
  (general-def '(normal insert visual emacs)
    :keymaps 'search-map
    :prefix "M-s"
    "d"   'consult-find            ;; Alt: consult-fd
    "D"   'consult-locate
    "g"   'consult-grep
    "G"   'consult-git-grep
    "r"   'consult-ripgrep
    "k"   'consult-keep-lines
    "u"   'consult-focus-lines)

  ;; Other custom bindings
  (general-def 'override "M-y" 'consult-yank-pop) ;; orig. yank-pop
#+end_src

** Undo System
Linear undo while maintaining all history.
#+begin_src emacs-lisp :tangle "lisp/ui-config.el" :mkdirp yes
  (use-package undo-fu
    :general
    ('normal
     "u" #'undo-fu-only-undo
     "U" #'undo-fu-only-redo
     "C-r" #'undo-fu-only-redo))

  ;; ignores encrypted files by default
  (use-package undo-fu-session
    :init (undo-fu-session-global-mode))
#+end_src

