ns-emacs.org
** Org Agenda

#+begin_src emacs-lisp :tangle "lisp/org-config.el" :mkdirp yes
  ;; Open the agenda file as the only window
  (setq org-agenda-window-setup 'only-window)
  (setq org-agenda-files
        '("~/ark/org/agenda/todo.org"       ; General unsorted todo items.
          "~/ark/org/agenda/inbox.org"      ; TBD!
          "~/ark/org/agenda/contacts.org"   ; Contacts list.
          "~/ark/org/agenda/projects.org"   ; Project mgmt.
          "~/ark/org/agenda/cron.org"       ; Recurring events/habits.
          ))

  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
          (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "PROJECT(x)" "|" "COMPLETED(c)" "CANC(k@)")
          (sequence "CONTACT(C)")))

  (setq org-refile-targets
        '(("archive.org" :maxlevel . 1)
          ("todo.org" :maxlevel . 1)))

  (setq org-tag-alist
        '((:startgroup)
           ;; Put mutually exclusive tags here
          (:endgroup)
          ("@errand" . ?E)
          ("@home" . ?H)
          ("@work" . ?W)
          ("@investing" . ?I)
          ("agenda" . ?a)
          ("followup" . ?f)
          ("planning" . ?p)
          ("publish" . ?P)
          ("batch" . ?b)
          ("note" . ?n)
          ("idea" . ?i)))

  ;; Configure custom agenda views
  ;; More on agenda view commands at `https://emacsdocs.org/docs/org/Agenda-Commands'
  (setq org-agenda-custom-commands
        `(("A" "Daily agenda and top priority tasks"
           ((tags-todo "*"
                       ((org-agenda-skip-function '(org-agenda-skip-if nil '(timestamp)))
                        (org-agenda-skip-function
                         `(org-agenda-skip-entry-if
                           'notregexp ,(format "\\[#%s\\]" (char-to-string org-priority-highest))))
                        (org-agenda-block-separator nil)
                        (org-agenda-overriding-header "Important Tasks Without a Date\n")))
            (agenda "" ((org-agenda-span 1)
                        (org-deadline-warning-days 0)
                        (org-agenda-block-separator nil)
                        (org-scheduled-past-days 0)
                        (org-agenda-day-face-function (lambda (date) 'org-agenda-date))
                        (org-agenda-format-date "%A %-e %B %Y")
                        (org-agenda-overriding-header "\nToday's Agenda\n")))
            (agenda "" ((org-agenda-start-on-weekday nil)
                        (org-agenda-start-day "+1d")
                        (org-agenda-span 3)
                        (org-deadline-warning-days 0)
                        (org-agenda-block-separator nil)
                        (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                        (org-agenda-overriding-header "\nNext Three Days\n")))
            (agenda "" ((org-agenda-time-grid nil)
                        (org-agenda-start-on-weekday nil)
                        ;; We don't want to replicate the previous section's
                        ;; three days, so we start counting from the day after.
                        (org-agenda-start-day "+4d")
                        (org-agenda-span 14)
                        (org-agenda-show-all-dates nil)
                        (org-deadline-warning-days 0)
                        (org-agenda-block-separator nil)
                        (org-agenda-entry-types '(:deadline))
                        (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                        (org-agenda-overriding-header "\nUpcoming Deadlines (+14d)\n")))
            (todo "PROJECT"
                  ((org-agenda-skip-function '(org-agenda-skip-if nil '(timestamp)))
                   (org-agenda-block-separator nil)
                   (org-agenda-overriding-header "\nProjects\n")))
            ))

          ("d" "Dashboard"
           ((agenda ""
                    (
                     (org-agenda-span 7)
                     (org-deadline-warning-days 0)
                     (org-scheduled-past-days 0)
                     (org-agenda-day-face-function (lambda (date) 'org-agenda-date))
                     (org-agenda-format-date "%A %-e %B %Y")
                     (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))))
            (tags-todo "+PRIORITY=\"A\""
                       ((org-agenda-overriding-header "High Priority")))
            (tags-todo "+followup" ((org-agenda-overriding-header "Needs Follow Up")))
            (todo "NEXT"
                  ((org-agenda-overriding-header "Next Actions")
                   (org-agenda-max-todos nil)))
            (todo "TODO"
                  ((org-agenda-overriding-header "Unprocessed Inbox Tasks")
                   (org-agenda-files '("~/ark/org/agenda/inbox.org"))
                   (org-agenda-text-search-extra-files nil)))
            (agenda "" ((org-agenda-span 14)
                        (org-agenda-start-day "+7d")
                        (org-deadline-warning-days 0)
                        (org-agenda-block-separator nil)
                        (org-agenda-day-face-function (lambda (date) 'org-agenda-date))
                        (org-agenda-format-date "%A %-e %B %Y")
                        (org-agenda-entry-types '(:deadline :scheduled))
                        (org-agenda-overriding-header "Upcoming Deadlines (+14d)")))
            ))
          ))

  (setq org-capture-templates
        `(("t" "Tasks")
          ("tt" "Task" entry (file "~/ark/org/agenda/todo.org")
           "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
          ("ts" "Clocked Entry Subtask" entry (clock)
           "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
          ("tr" "Recurring Task" entry (file "~/ark/org/agenda/recurrent.org")
           "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

          ;; Projects
          ("p" "Projects")
          ("pt" "Task" entry (file "~/ark/org/agenda/projects.org")
           "* PROJECT %?\n  %U\n  %a\n  %i" :empty-lines 1)
          ("ps" "Clocked Entry Subtask" entry (clock)
           "* PROJECT %?\n  %U\n  %a\n  %i" :empty-lines 1)
          ("pr" "Pull Request" entry (file "~/ark/org/agenda/projects.org")
           "* TODO %?\n  :PROPERTIES:\n:DATE: %U\n:LINK: %^L \n:END:" :empty-lines 1)

          ;; Contacts
          ("c" "Contacts" entry (file "~/ark/org/agenda/contacts.org")
           "* CONTACT %^{Name}\n:PROPERTIES:\n:DATE: %^{Specify birthday}t\n:PHONE: %^{Phone number}\n:END:\n%?" :empty-lines 1)

          ;; Journal Entries
          ("j" "Journal Entries")
          ("je" "General Entry" entry
           (file+olp+datetree "~/ark/org/journal/journal.org")
           "\n* %<%I:%M %p> - %^{Title} \n\n%?\n\n"
           :tree-type week
           :clock-in :clock-resume
           :empty-lines 1)
          ("jt" "Task Entry" entry
           (file+olp+datetree "~/ark/org/journal/journal.org")
           "\n* %<%I:%M %p> - Task Notes: %a\n\n%?\n\n"
           :tree-type week
           :clock-in :clock-resume
           :empty-lines 1)
          ("jj" "Journal" entry
           (file+olp+datetree "~/ark/org/journal/journal.org")
           "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
           :tree-type week
           :clock-in :clock-resume
           :empty-lines 1)))

  (define-key global-map (kbd "C-c j")
              (lambda () (interactive) (org-capture nil "jj")))

#+end_src

** Nicer Heading Bullets
org-bullets replaces the heading stars in org-mode buffers with nicer looking characters that you can control.

#+begin_src emacs-lisp :tangle "lisp/org-config.el" :mkdirp yes
  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
 #+end_src

** Center Org Buffers
We use visual-fill-column to center org-mode buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document.

#+begin_src emacs-lisp :tangle "lisp/org-config.el" :mkdirp yes
  (defun efs/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . efs/org-mode-visual-fill))
 #+end_src

** Auto-show Markup Symbols
#+begin_src emacs-lisp :tangle "lisp/org-config.el" :mkdirp yes
  (use-package org-appear
     :hook (org-mode . org-appear-mode))
#+end_src

* Org Modules and Packages
** Evil Org
#+begin_src emacs-lisp :tangle "lisp/org-config.el" :mkdirp yes
  (use-package evil-org
    :after org
    :hook (org-mode . (lambda () evil-org-mode))
    :config
    (require 'evil-org-agenda)
    (evil-org-set-key-theme '(navigation todo insert textobjects additional))
    (evil-org-agenda-set-keys))

  (ns/leader-spc 'override
    "o"   '(:ignore t :wk "org mode")

    "oi"  '(:ignore t :wk "insert")
    "oil" '(org-insert-link :wk "insert link")

    "oo"  '(org-agenda :wk "open agenda")

    "on"  '(org-toggle-narrow-to-subtree :wk "toggle narrow")
    "os"  '(consult-org-roam-search :wk "search notes")
    ;; "oa"  '(org-agenda :wk "status")
    "ot"  '(org-todo-list :wk "todos")
    "oc"  '(org-capture t :wk "capture")
    "ox"  '(org-export-dispatch t :wk "export"))

  (defun ns/open-custom-agenda ()
    "Open the custom agenda view."
    (interactive)
    (org-agenda nil "d"))

  (general-def 'override
    :prefix "C-c"
    "a" '(org-agenda :wk "org agenda")
    "c" '(org-capture :wk "org capture")
    "d" '(ns/open-custom-agenda :wk "main agenda dashboard")
    )
#+end_src

** Babel
To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.  [[https://orgmode.org/worg/org-contrib/babel/languages.html][This page]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp :tangle "lisp/org-config.el" :mkdirp yes
  (with-eval-after-load 'org
    (org-babel-do-load-languages
        'org-babel-load-languages
        '(
          (emacs-lisp . t)
          (python . t)
          (shell . t)
          (C . t)
         ))
    (push '("conf-unix" . conf-unix) org-src-lang-modes))
  ;; Disable execution confirmations
  (setq org-confirm-babel-evaluate nil)
#+end_src

** Structure Templates
Org Mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature enables you to quickly insert code blocks into your Org files in combination with =org-tempo= by typing followed by the template name like =el= or =py= and then press =TAB=.  For example, to insert an empty =emacs-lisp= block below, you can type =el= and press =TAB= to expand into such a block.

You can add more =src= block templates below by copying one of the lines and changing the two strings at the end, the first to be the template name and the second to contain the name of the language [[https://orgmode.org/worg/org-contrib/babel/languages.html][as it is known by Org Babel]].

 #+begin_src emacs-lisp :tangle "lisp/org-config.el" :mkdirp yes
   (use-package org-tempo
     :ensure nil
     :after org
     :config
     (let ((templates '(("sh"  . "src sh")
                        ("el"  . "src emacs-lisp")
                        ("ini" . "src emacs-lisp :tangle \"init.el\" :mkdirp yes")
                        ("vim" . "src vim")
                        ("py"  . "src python")
                        ("rs"  . "src rust")
                        ("cs"  . "src csharp")
                        ("y"  . "src yaml")
                        ;; Leetcode snippet
                        ("leet" .
                         "src C++ :includes <iostream> :flags -I./src/util -std=c++20 :tangle src/ .cpp")

                        ("cpp" . "src C++ :includes <iostream>"))))
       (dolist (template templates)
         (push template org-structure-template-alist))))
#+end_src

** Org Journal
 #+begin_src emacs-lisp :tangle "lisp/org-config.el" :mkdirp yes
   (use-package org-journal
     :custom
     (org-journal-dir "~/ark/org/journal/"))

   (ns/leader-spc 'override
     "oj"  '(:ignore t :wk "org journal")
     "ojn" '(org-journal-new-entry :wk "new journal entry")
     "ojs" '(org-journal-search-forever :wk "search journal"))

 #+end_src

** Org Drill
Org drill is a spaced repetition algorithm that uses org files as sources of "facts" to be memorized. The =Anki= application took heavy inspiration from this package.
 #+begin_src emacs-lisp :tangle "lisp/org-config.el" :mkdirp yes
   (use-package org-drill)
 #+end_src

* Org Roam
** Org Roam Config
[[[[https://github.com/org-roam/org-roam]]][Org Roam]] is a plain-text, graph-based personal knowledge management system.

#+begin_src emacs-lisp :tangle "lisp/org-roam-config.el" :mkdirp yes
  (use-package org-roam
    :custom
    (org-roam-directory (file-truename "~/ark/org"))
    (org-roam-dailies-directory "~/ark/org/journal")
    (org-roam-completion-everywhere t)
    :config
    (org-roam-db-autosync-mode)

    ;; If you're using a vertical completion framework, you might want a more informative completion interface
    ;; (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    ;; If using org-roam-protocol
    ;; (require 'org-roam-protocol)
    )

  ;; Keybindings
  (ns/leader-spc
    "n"  '(:ignore t :wk "org node selection")
    "nl" '(org-roam-buffer-toggle :wk "org roam buffer toggle")
    "nf" '(org-roam-node-find :wk "org roam buffer find")
    ;; "ng" '(org-roam-graph :wk "org roam graph")
    "ni" '(org-roam-node-insert :wk "org roam insert")
    "nc" '(org-roam-capture :wk "org roam capture")
    "nj" '(org-roam-dailies-capture-today :wk "org roam dailies capture today"))

#+end_src

