lisp/org-roam-config.el
(use-package org-roam
  :custom
  (org-roam-directory (file-truename "~/ark/org"))
  (org-roam-dailies-directory "~/ark/org/journal")
  (org-roam-completion-everywhere t)
  :config
  (org-roam-db-autosync-mode)

  ;; If you're using a vertical completion framework, you might want a more informative completion interface
  ;; (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
  ;; If using org-roam-protocol
  ;; (require 'org-roam-protocol)
  )

;; Keybindings
(ns/leader-spc
  "n"  '(:ignore t :wk "org node selection")
  "nl" '(org-roam-buffer-toggle :wk "org roam buffer toggle")
  "nf" '(org-roam-node-find :wk "org roam buffer find")
  ;; "ng" '(org-roam-graph :wk "org roam graph")
  "ni" '(org-roam-node-insert :wk "org roam insert")
  "nc" '(org-roam-capture :wk "org roam capture")
  "nj" '(org-roam-dailies-capture-today :wk "org roam dailies capture today"))
