ns-emacs.org
** Org Roam Capture Templates
Org roam allows you to create various capture templates.

#+begin_src emacs-lisp :tangle "lisp/org-roam-config.el" :mkdirp yes
  (setq org-roam-capture-templates
    '(("m" "main" plain
        "%?"
        :if-new
        (file+head "main/%<%Y%m%d%H%M%S>-${slug}.org"
                   "#+title: ${title}\n#+options: tex:t toc:nil\n#+startup: inlineimages latexpreview\n")
        :immediate-finish t
        :unnarrowed t)
        ("r" "reference" plain "%?"
        :if-new
        (file+head "reference/${title}.org"
                   "#+title: ${title}\n#+options: tex:t toc:nil\n#+startup: inlineimages latexpreview\n")
        :immediate-finish t
        :unnarrowed t)
        ("a" "article" plain "%?"
        :if-new
        (file+head "articles/${title}.org"
                   "#+title: ${title}\n#+options: tex:t toc:nil\n#+startup: inlineimages latexpreview\n#+filetags: :article:\n")
        :immediate-finish t
        :unnarrowed t)))
#+end_src
*** Define the Type of a Node

It can be useful to differentiate the different types of zettels at completion time.

#+begin_src emacs-lisp :tangle "lisp/org-roam-config.el" :mkdirp yes
  (with-eval-after-load 'org-roam
    (cl-defmethod org-roam-node-type ((node org-roam-node))
      "Return the TYPE of NODE."
      (condition-case nil
          (file-name-nondirectory
           (directory-file-name
            (file-name-directory
             (file-relative-name
              (org-roam-node-file node)
              org-roam-directory))))
        (error "")))
    )
#+end_src

*** Modifying Display Template to Show Node Type

#+begin_src emacs-lisp :tangle "lisp/org-roam-config.el" :mkdirp yes
  (setq org-roam-node-display-template
        (concat "${type:15} ${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
#+end_src

** Org Roam UI Frontend
[[https://github.com/org-roam/org-roam-ui][org-roam-ui]] is a graphical frontend for displaying org roam nodes in a graph-like interface.

#+begin_src emacs-lisp :tangle "lisp/org-roam-config.el" :mkdirp yes
  (use-package websocket
    :after org-roam)

  (use-package org-roam-ui
    :after org-roam
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-default-view '2d
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

  (ns/leader-spc
    "ng" '(org-roam-ui-mode :wk "org roam ui graph"))
#+end_src
* Development

** LSP
*** lsp-mode
[[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] enables IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes

#+end_src

*** Eglot
#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
  (defun ns/prog-mode-setup ()
    "Setup some sensible defaults."
    (setq truncate-lines t) ; Avoid code wrap.
    (display-fill-column-indicator-mode 1) ; Show fill column (already set to 80).
    (flymake-mode 1) ; Basic syntax checking.
    )

  (use-package eglot
    :hook
    (prog-mode . ns/prog-mode-setup)
    (eglot-managed-mode . eglot-inlay-hints-mode)
    ((c-mode
      c++-mode
      csharp-mode
      python-mode
      rust-mode
      yaml-mode
      ) . eglot-ensure)
    :config
    ;; (setq eglot-stay-out-of '(flymake))

    ;; Optional: improve eldoc display
    (setq eldoc-echo-area-use-multiline-p t)

    (setq eglot-autoshutdown t                ; Shutdown servers when last buffer closes
          eglot-sync-connect nil              ; Connect asynchronously
          eglot-events-buffer-size 0          ; Disable noisy *eglot-events* logging
          eglot-ignored-server-capabilities
          '(:documentHighlightProvider        ; Don’t auto-highlight symbol under point
            :documentOnTypeFormattingProvider ; Avoid intrusive on-type formatting
            :inlayHintProvider))
    ;; Use header line for breadcrumbs (like VSCode symbol path)
    (setq eglot-display-context 'header-line)
    )

  ;; TODO: Convert these keybinds to eglot.
  ;; (ns/leader-m 'lsp-mode-map
  ;;  "a" 'lsp-execute-code-action
  ;;  "v" 'lsp-avy-lens
  ;;  "n" 'lsp-describe-thing-at-point
  ;;  ;; "i" 'lsp-goto-implementation
  ;;  "d" 'lsp-find-definition
  ;;  "D" 'lsp-find-declaration
  ;;  "t" 'lsp-find-type-definition
  ;;  "x" 'lsp-find-references
  ;;  "r" 'lsp-rename
  ;;  "R" 'lsp-restart-workspace
  ;;  "=" 'lsp-format-buffer
  ;;  "l" 'lsp-workspace-show-log)
#+end_src

*** consult-eglot
#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
  (use-package consult-eglot
    :after (consult eglot)
    :bind (:map eglot-mode-map
           ("C-c l d" . consult-eglot-symbols)))
#+end_src

** Debugging with dap-mode
[[https://emacs-lsp.github.io/dap-mode/][dap-mode]] is an excellent package for bringing rich debugging capabilities to Emacs via the [[https://microsoft.github.io/debug-adapter-protocol/][Debug Adapter Protocol]].  You should check out the [[https://emacs-lsp.github.io/dap-mode/page/configuration/][configuration docs]] to learn how to configure the debugger for your language.  Also make sure to check out the documentation for the debug adapter to see what configuration parameters are available to use for your debug templates!

#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
  (use-package dap-mode
    :after eglot-mode
    :config
    (dap-mode 1)
    (dap-ui-mode 1)
    (dap-tooltip-mode 1))
#+end_src

** TRAMP Mode
TRAMP (Transparent remote access, multiple protocols) allows users to edit remote files.

#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
  ;; Setup TRAMP mode
  (setq tramp-default-method "ssh")
#+end_src

** Yasnippet
A template system for Emacs.

#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
  (use-package yasnippet
    :disabled t
    :general
    (ns/leader-ct 'override
      "Y" #'yas-new-snippet)
    :config
    ;; Don't expand snippets in normal mode
    (general-def 'normal yas-minor-mode-map
      [remap yas-expand] #'ignore)
    (general-def input-decode-map "C-i" [C-i])
    (general-def 'insert yas-minor-mode-map
      "<C-i>" #'yas-expand))
#+end_src

*** Extra Snippets
#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
  (use-package yasnippet-snippets
    :disabled t
    :after yasnippet
    :demand t
    :config
    ;; Necessary for my personal snippets to override some of these
  (yas-reload-all))
#+end_src

*** Consult Yasnippet
A better ~yas-insert-snippet~.
#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
  (use-package consult-yasnippet
    :disabled t
    :general ('insert "C-<tab>" #'consult-yasnippet))
#+end_src

** Projectile
[[https://projectile.mx/][Projectile]] is a project management library for Emacs which makes it a lot easier to navigate around code projects for various languages.  Many packages integrate with Projectile so it's a good idea to have it installed even if you don't use its commands directly.

#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    ;; :custom ((projectile-completion-system 'ivy))
    :custom ((projectile-completion-system 'default))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/git")
      (setq projectile-project-search-path '("~/git")))
    (setq projectile-switch-project-action #'projectile-dired))

  (ns/leader-m 'override
    "p"  '(:ignore p :wk "projectile commands")
    "pf" '(projectile-find-file :wk "projectile find file")
    "ps" '(projectile-switch-project :wk "projectile switch project")
    "pg" '(consult-ripgrep :wk "consult ripgrep")
    "pp" '(projectile-find-file :wk "projectile find file")
    "pc" '(projectile-compile-project :wk "projectile compile project")
    "pd" '(projectile-dired :wk "projectile dired"))
#+end_src

** Magit
[[https://magit.vc/][Magit]] is the best Git interface I've ever used.  Common Git operations are easy to execute quickly using Magit's command panel system.

#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
  (use-package magit
    :commands magit-status
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (use-package forge
    :after magit)

  (ns/leader-m 'override
    "g"  '(:ignore g :wk "magit commands")
    "gs" '(magit-status :wk "git status")
    "gd" '(magit-diff :wk "git diff")
    "gl " '(magit-log :wk "git log")
    ;; Pushing and pulling
    "gk " '(magit-push :wk "git push")
    "gj " '(magit-pull  :wk "git pull")
    "gc " '(magit-commit :wk "git commit")
    "ga " '(magit-stage :wk "git add")
    "gi " '(magit-init :wk "git init"))
#+end_src

** Forge
Forge allows use to work with varios git forges using the magit interface.

#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
  ;; NOTE: Make sure to configure a GitHub token before using this package!
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
  (use-package forge
    :after 'magit)
#+end_src

** Flymake
#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
    ;; (defun ns/flymake-cc-default ()
    ;;   "Default compile command for C++ files without a Makefile."
    ;;   (if buffer-file-name
    ;;       (let (
    ;;             (base-name  (file-name-sans-extension (file-name-nondirectory buffer-file-name))))
    ;;         (concat "g++ --std=c++23 -g -o "
    ;;                 base-name
    ;;                 " " base-name ".cpp"
    ;;                 " && ./" base-name))
    ;;         (message "Buffer is not visiting a file")))

    ;; (use-package flymake
    ;;   :hook (c++-mode . flymake-mode)
    ;;   :custom
    ;;   ;; Automatically continue without needing to hit Enter
    ;;   (compilation-read-command nil)
    ;;   :config
    ;;   (setq-default compile-command '(ns/flymake-cc-default))
    ;;   )

    ;; (general-def '(normal insert visual)
    ;;   :keymaps 'c++-mode-map
    ;;   "C-c C-c" 'compile)
#+end_src

** Rainbow Delimiters
[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth.  This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
  (use-package rainbow-delimiters
    :hook
    (prog-mode . rainbow-delimiters-mode)
    (org-mode . rainbow-delimiters-mode)
    (lisp-mode . rainbow-delimiters-mode))
#+end_src

** Smartparens
[[https://github.com/Fuco1/smartparens][Smartparens]] is a minor mode for dealing with pairs in Emacs.

#+begin_src emacs-lisp :tangle "lisp/development-config.el" :mkdirp yes
  (use-package smartparens
    :init
    (smartparens-global-mode)
    :config
    ;; load default config
    (require 'smartparens-config))
#+end_src


* Programming Languages
** C/C++

#+begin_src emacs-lisp :tangle "lisp/programming-languages-config.el" :mkdirp yes
  (use-package ccls
    :custom
    (ccls-executable "ccls"))
#+end_src

** Common Lisp

#+begin_src emacs-lisp :tangle "lisp/programming-languages-config.el" :mkdirp yes
  ;; Load SLY
  ;; (require 'sly)
  ;; Set the Common Lisp implementation to SBCL
  ;; (setq inferior-lisp-program "/usr/bin/sbcl")

  ;; (add-to-list 'sly-contribs 'sly-asdf 'append)

#+end_src

** Go
#+begin_src emacs-lisp :tangle "lisp/programming-languages-config.el" :mkdirp yes
  (use-package go-mode
    :hook
    (go-mode . lsp-deferred))
#+end_src

** Guile
Setup for guile scheme development.
#+begin_src emacs-lisp :tangle "lisp/programming-languages-config.el" :mkdirp
  (use-package geiser
    :config
    (setq geiser-active-implementations '(guile)))

  (use-package geiser-guile)
#+end_src

