lisp/programming-languages-config.el
(use-package ccls
  :custom
  (ccls-executable "ccls"))

;; Load SLY
;; (require 'sly)
;; Set the Common Lisp implementation to SBCL
;; (setq inferior-lisp-program "/usr/bin/sbcl")

;; (add-to-list 'sly-contribs 'sly-asdf 'append)

(use-package go-mode
  :hook
  (go-mode . lsp-deferred))

(use-package geiser
  :config
  (setq geiser-active-implementations '(guile)))

(use-package geiser-guile)
