ns-emacs.org
** GPTel
[[https://github.com/karthink/gptel][gptel]] is a simple llm interface for emacs. I have multiple backends to choose from, including [[https://github.com/ollama/ollama][Ollama]], openrouter, groq, and gemini.

#+begin_src emacs-lisp :tangle "lisp/applications-config.el" :mkdirp yes
  (use-package gptel
    :custom
    (gptel-default-mode 'org-mode)
    (gptel-model 'moonshotai/kimi-k2-instruct)
    :config

    ;; Set up model backends.
    (setq ns/gptel-ollama-backend (gptel-make-ollama "shodan"
                                    :host "shodan:11434" ;; Or use shodan.local for mDNS.
                                    :stream t
                                    :models '(deepseek-r1:1.5b-ns
                                              gemma3:1b
                                              gemma3:latest
                                              llama3.2:latest
                                              llama3.2-ns
                                              qwen3:1.7b-ns
                                              qwen3:1.7b
                                              qwen3:4b-ns)))

    (setq ns/gptel-openrouter-backend
          (gptel-make-openai "openrouter"
            :host "openrouter.ai"
            :endpoint "/api/v1/chat/completions"
            :stream t
            :key (lambda () (auth-source-pass-get 'secret "openrouter/key"))
            :models '(deepseek/deepseek-chat-v3.1:free
                      openai/gpt-oss-20b:free
                      qwen/qwen3-coder:free
                      moonshotai/kimi-k2:free
                      )))

    (setq ns/gptel-groq-backend
          (gptel-make-openai "groq"
            :host "api.groq.com"
            :endpoint "/openai/v1/chat/completions"
            :stream t
            :key (lambda () (auth-source-pass-get 'secret "groq/key"))
            :models '(moonshotai/kimi-k2-instruct
                      openai/gpt-oss-120b
                      llama-3.1-70b-versatile
                      qwen/qwen3-32b
                      openai/gpt-oss-20b)))

    (setq ns/gptel-gemini-backend
          (gptel-make-gemini "gemini"
            :stream t
            :key (lambda () (auth-source-pass-get 'secret "gemini/key"))
            :models '(gemini-2.5-flash
                      gemini-2.0-flash-lite
                      (gemini-2.5-pro
                       :description
                       "Complex reasoning tasks, problem solving and data extraction"
                       :capabilities (tool json)
                       :mime-types
                       ("image/jpeg" "image/png" "image/webp" "image/heic")))))


    ;; Set the defualt model backend.
    (setq gptel-backend ns/gptel-groq-backend)

    ;; Configure system prompts.
    (gptel-make-preset "Incremental Reasoning"
      :system-message "Let's think step by step to assure we arrive at the correct answer."
      :backend      "groq"
      :model        'moonshotai/kimi-k2-instruct)

    (gptel-make-preset 'proofreader
      :description "Preset for proofreading tasks."
      :backend "gemini"
      :model 'gemini-2.0-flash
      :tools '("read_buffer" "spell_check" "grammar_check")
      :temperature 0.7
      :use-context 'system)

    (gptel-make-preset 'websearch
      :description  "gemini with basic web search capability."
      :backend      "gemini"
      :model        'gemini-2.5-flash
      :tools        '("search_web" "read_url" "get_youtube_meta"))

    (gptel-make-preset 'resume
      :system-message "Use the following resume to answer interview questions in a thoughtful way."
      :backend "shodan"
      :pre (lambda () (gptel-add-file "~/git/interviews/resume.org")))
    )

  (defun ns/gptel-select-backend ()
    "Select a gptel backend and update `gptel-backend`."
    (interactive)
    (let* ((backends '(("shodan" . ns/gptel-ollama-backend)
                       ("openrouter" . ns/gptel-openrouter-backend)
                       ("groq" . ns/gptel-groq-backend)
                       ("gemini" . ns/gptel-gemini-backend)
                       ))
           (choice (completing-read "Select gptel backend: " (mapcar #'car backends)))
           (backend (cdr (assoc choice backends))))
      (when backend
        (setq gptel-backend (symbol-value backend))
        (message "gptel backend set to: %s" choice))))

  (defun ns/quickdraw (prompt)
    (gptel-request prompt
      :callback
      (lambda (response info)
        (when response
          (with-current-buffer (get-buffer-create "*quickdraw*")
            (org-mode)
            (goto-char (point-max))
            (unless (bobp)
              (insert (format "\n\n")))
            (insert (format "* %s\n" (format-time-string "%F %T")))
            (insert response)
            (display-buffer (current-buffer)))))))

  (defun ns/quickdraw-selection ()
    "Quick analysis of selected region, results go to *quickdraw* buffer."
    (interactive)
    (unless (region-active-p)
      (user-error "No region selected"))
    (let* ((selected-text (buffer-substring-no-properties (region-beginning) (region-end)))
           (prompt (format "Provide a quick, concise explanation of the following:\n%s" selected-text)))
      (ns/quickdraw prompt)
      ))

  (defun ns/quickdraw-prompt ()
    "Send a prompt from minibuffer to *quickdraw* buffer."
    (interactive)
    (let ((prompt (read-string "Quickdraw: ")))
      (when (string-empty-p prompt)
        (user-error "Empty prompt"))
      (ns/quickdraw prompt)
      ))

  (with-eval-after-load 'evil
    (keymap-set evil-visual-state-map "C-c q" #'ns/quickdraw-selection)
    (keymap-global-set "C-c q" #'ns/quickdraw-prompt))

  ;; Gptel keyboard shortcuts.
  (ns/leader-comma
    "b" '(gptel-abort :wk "gptel abort")
    "g" '(gptel-mode :wk "gptel mode")
    "p" '(gptel :wk "gptel prompt")
    "r" '(gptel-rewrite :wk "gptel rewrite")
    "s" '(gptel-send :wk "gptel send")
    "m" '(gptel-menu :wk "gptel menu")
    "a" '(gptel-add :wk "gptel add")
    "f" '(gptel-add-file :wk "gptel add file"))

  ;; (ns/leader-spc
  ;;   "g"  '(:ignore t :wk "gptel")
  ;;   "gb" '(gptel-abort :wk "gptel abort")
  ;;   "gg" '(gptel-mode :wk "gptel mode")
  ;;   "gp" '(gptel :wk "gptel prompt")
  ;;   "gr" '(gptel-rewrite :wk "gptel rewrite")
  ;;   "gs" '(gptel-send :wk "gptel send")
  ;;   "gm" '(gptel-menu :wk "gptel menu")
  ;;   "ga" '(gptel-add :wk "gptel add")
  ;;   "gf" '(gptel-add-file :wk "gptel add file"))
#+end_src

** Setup Instructions
We will configure Ollama to listen on all local network interfaces. Start editing the systemd unit with the command ~sudo systemctl edit ollama.service~ and adding the following:

#+begin_src sh
  [Unit]
  After=network-online.target avahi-daemon.service
  Wants=network-online.target avahi-daemon.service

  [Service]
  Environment="OLLAMA_HOST=0.0.0.0"
#+end_src

Allow port =11434= on your operating system's firewall. Then, use the following curl command on another device to ensure that you can reach the host:

#+begin_src sh
  # Replace with `localhost` if on the Ollama server.
  curl http://shodan:11434/api/chat -d '{
    "model": "llama3.2",
    "messages": [
      { "role": "user", "content": "why is the sky blue?" }
    ]
  }'
#+end_src

* Window Management

** Perspective
#+begin_src emacs-lisp :tangle "lisp/window-config.el" :mkdirp yes
  (use-package perspective
    :custom
    (persp-initial-frame-name "main")
    (persp-mode-prefix-key (kbd "C-a"))
    :init
    (unless (equal persp-mode t)
      (persp-mode)))

  (ns/leader-ca 'persp-mode-map
    "s"  '(persp-switch :wk "query or create persp")
    "k"  '(persp-kill :wk "kill a persp")
    "r"  '(persp-rename :wk "rename a persp")
    ;; Buffer management
    "a"  '(persp-add-buffer :wk "add buffer to current persp")
    "A"  '(persp-set-buffer :wk "add buffer to current persp, remove from others")
    "b"  '(persp-switch-to-buffer :wk "switch to buffer, global by default")
    ;; Switch perspectives
    "n"  '(persp-next :wk "next persp")
    "p"  '(persp-prev :wk "previous persp")
    ;; Merging and importing
    "m"  '(persp-merge :wk "merge buffers into another persp")
    "u"  '(persp-unmerge :wk "undo effects of `persp-merge'")
    "i"  '(persp-import :wk "import a given perspective from another frame")
    ;; Save and load perspectives
    "C-s"  '(persp-state-save :wk "Save all persps in all frames to a file")
    "C-l"  '(persp-state-load :wk "load all persps from a file")
  )
 #+end_src

** Popper
#+begin_src emacs-lisp :tangle "lisp/window-config.el" :mkdirp yes
  (use-package popper
    :init
    (setq popper-reference-buffers
          '("\\*\\*Messages"
            "Output\\*$"
            "\\*Async Shell Command\\*"
            help-mode
            compilation-mode))
    (popper-mode 1)
    (popper-echo-mode 1))                ; For echo area hints

  (general-def 'override
    "C-`" '(popper-toggle :wk "toggle popup")
    "M-`" '(popper-cycle :wk "cycle through popups")
    "C-M-`" '(popper-toggle-type :wk "change current buffer's toggle type"))

#+end_src

* File Management
** Dired

Dired is a built-in file manager for Emacs that does some pretty amazing things!  Here are some key bindings you should try out:

*** Key Bindings
**** Navigation

*Emacs* / *Evil*
- =n= / =j= - next line
- =p= / =k= - previous line
- =j= / =J= - jump to file in buffer
- =RET= - select file or directory
- =^= - go to parent directory
- =S-RET= / =g O= - Open file in "" window
- =M-RET= - Show file in other window without focusing (previewing files)
- =g o= (=dired-view-file=) - Open file but in a "preview" mode, close with =q=
- =g= / =g r= Refresh the buffer with =revert-buffer= after changing configuration (and after filesystem changes!)

**** Marking files

- =m= - Marks a file
- =u= - Unmarks a file
- =U= - Unmarks all files in buffer
- =* t= / =t= - Inverts marked files in buffer
- =% m= - Mark files in buffer using regular expression
- =*= - Lots of other auto-marking functions
- =k= / =K= - "Kill" marked items (refresh buffer with =g= / =g r= to get them back)
- Many operations can be done on a single file if there are no active marks!

**** Copying and Renaming files

- =C= - Copy marked files (or if no files are marked, the current file)
- Copying single and multiple files
- =U= - Unmark all files in buffer
- =R= - Rename marked files, renaming multiple is a move!
- =% R= - Rename based on regular expression: =^test= , =old-\&=

*Power command*: =C-x C-q= (=dired-toggle-read-only=) - Makes all file names in the buffer editable directly to rename them!  Press =Z Z= to confirm renaming or =Z Q= to abort.

**** Deleting files

- =D= - Delete marked file
- =d= - Mark file for deletion
- =x= - Execute deletion for marks
- =delete-by-moving-to-trash= - Move to trash instead of deleting permanently

***** Creating and extracting archives

- =Z= - Compress or uncompress a file or folder to (=.tar.gz=)
- =c= - Compress selection to a specific file
- =dired-compress-files-alist= - Bind compression commands to file extension

***** Other common operations

- =T= - Touch (change timestamp)
- =M= - Change file mode
- =O= - Change file owner
- =G= - Change file group
- =S= - Create a symbolic link to this file
- =L= - Load an Emacs Lisp file into Emacs


*** Configuration

#+begin_src emacs-lisp :tangle "lisp/dired-config.el" :mkdirp yes
  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer))

  (use-package dired-single
    :commands (dired dired-jump))

  (use-package dired-open
    :commands (dired dired-jump)
    :config
    ;; Doesn't work as expected!
    ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
    (setq dired-open-extensions '(("png" . "feh")
                                  ("mkv" . "mpv"))))
#+end_src
